Repository: dvconsultores/rhino_bot
Catalog: telegram_bot/locales/*/LC_MESSAGES/messages.po
Languages: es

source: 🤖 Register
es: 🤖 Registrar - Actualizar Datos

# plans
source: 📋 View Plans
es: 📋 Ver Planes

# locations
source: 📍 View Locations
es: 📍 Ver Ubicaciones

# schedule
source: 📅 View Schedule
es: 📅 Ver Horario

# payment
source: 💳 Register Payment
es: 💳 Registrar Pago

# administrator
source: 🛠️ Administer
es: 🛠️ Administrar

# language
source: 🌐 Change Language
es: 🌐 Cambiar Idioma

# welcome_message
source: Welcome to Rhino Bot {nom} - {cid}, you can register your payments, view locations, prices, and much more {nom}
es: Bienvenido a Rhino Bot {nom} - {cid}, puedes registrar tus pagos, ver ubicaciones, precios y mucho más {nom}

# available
source: Available options
es: Opciones disponibles

source: Cancel
es: Cancelar

# language_text
source: 🌐 Select your preferred language below
es: 🌐 Selecciona tu idioma preferido a continuación

# language_error
source: Invalid value, you must select 'ES' for Spanish or 'EN' for English
es: Valor no válido, debes seleccionar 'ES' para español o 'EN' para inglés

# language_set
source: 🌐 Preferred language saved successfully
es: 🌐 Idioma preferido guardado con éxito

# procesing
source: ⏳ Processing ...
es: ⏳ Procesando ...

# general_yes
source: Yes
es: Sí

# general_cancel
source: Cancel
es: Cancelar

# get_user_id
source: Please provide the user ID:
es: Por favor, proporciona el ID del usuario:

# create_user_name
source: Please enter your name:
es: Por favor, ingrese su nombre:

# create_user_name_required
source: Name is required. Please enter the user's name:
es: El nombre es obligatorio. Por favor, ingresa el nombre del usuario:

# create_user_last_name
source: Please enter your last name:
es: Por favor, ingrese su apellido:

# create_user_last_name_required
source: Last name is required. Please enter the user's last name:
es: El apellido es obligatorio. Por favor, ingresa el apellido del usuario:

# create_user_cedula
source: Please enter your identification id:
es: Por favor, ingrese su cédula (sólo numérico):

# create_user_cedula_required
source: Cedula is required. Please enter the user's cedula:
es: La cédula es obligatoria y debe ser un valor numérico:

# create_user_email
source: Please enter your email account:
es: Por favor ingrese su dirección de correo electrónico:

# create_user_email_required
source: Cedula is required. Please enter the user's cedula:
es: El correo electrónico es obligatorio. Por favor, ingresa el correo electrónico del usuario:

# create_user_date_of_birth
source: Please enter your date of birth (dd/mm/yyyy):
es: Por favor, ingrese su fecha de nacimiento (dd/mm/aaaa):

# create_user_date_of_birth_required
source: Invalid date format. Please re-enter (dd/mm/yyyy):
es: Formato de fecha no válido. Por favor, reingresa (dd/mm/aaaa):

# create_user_phone_number
source: Please enter your phone number:
es: Por favor, ingrese su número de teléfono (sólo numérico):

# create_user_phone_number_required
source: Invalid date format. Please re-enter (dd/mm/yyyy):
es: El número de teléfono es obligatorio y debe ser un valor numérico:

# create_user_ig
source: Please enter your Instagram handle (or type 'skip' or click on 'Skip' to leave it empty):
es: Por favor, ingrese su cuenta de Instagram (o escribe 'skip' o haz clic en 'Skip' para dejarlo vacío):

# create_user_confirm
source: Please confirm the details:
es: Por favor, confirma los detalles:

# create_user_success
source: User created successfully!
es: ¡Usuario creado con éxito!

# create_user_fail
source: Failed to create user.
es: Error al crear el usuario.

# create_user_try_again
source: Let's try again. Please enter the user's name:
es: Intentémoslo de nuevo. Por favor, ingresa el nombre del usuario:

# create_user_cancel
source: User creation cancelled.
es: Creación de usuario cancelada.

# create_user_title_email
source: Correo electrónico:
es: Email:
